{
  "backend/main.mo": "Main Motoko actor defining the social media app's backend with data types and persistent state for user profiles, character profiles, posts, comments, stories, videos, and conversations, plus public query/update APIs mixing in authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report listing implemented features related to fixing blank screens in the Messages/conversation flow, loading conversations on mount, CreateConversationDialog backend integration, and MessageThread loading/error states, each mapped to source files and test IDs.",
  "frontend-file-summaries.txt": "A JSON document providing one- to two-sentence summaries of every frontend source file, serving as a reference index for the frontend codebase's components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for the design system's color tokens in both light and dark themes, plus base body and border styles.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to the app description and mounting the React root via the main.tsx module script.",
  "frontend/ops/production-deployment-retry-runbook.md": "Runbook documenting the steps to retry a production deployment of Draft Version 4 without code changes, including pre-deployment verification checklist and deployment initiation instructions.",
  "frontend/src/App.tsx": "Root React component that gates rendering on Internet Identity auth state, shows a loading spinner during initialization, conditionally renders ProfileSetupDialog for new users, and wraps everything in ThemeProvider with a Toaster.",
  "frontend/src/components/AppShell.tsx": "Main application shell rendering a sticky header with logo and sign-out button, a bottom navigation bar with five tabs (Home, Videos, Messages, Characters, Profile), and the currently active page component.",
  "frontend/src/components/AvatarImage.tsx": "Reusable avatar component that renders a cache-busted image URL using avatarTimestamp and a retry counter on error, falling back to a default avatar image or initials in a gradient fallback.",
  "frontend/src/components/CharacterFormDialog.tsx": "A dialog form component for creating or editing a character, handling name/bio inputs and avatar upload with progress tracking via mutation hooks.",
  "frontend/src/components/CommentsPanel.tsx": "Displays a sorted list of comments for a given post and provides a form to submit new comments, with author selection between the user and available characters.",
  "frontend/src/components/CreateConversationDialog.tsx": "A dialog that lets the user select one or more characters to start a new conversation, then calls the createConversation mutation and notifies the parent with the new ID.",
  "frontend/src/components/CreateStoryDialog.tsx": "A dialog form for creating a new story post with an image upload, optional caption, and author selection (user or character).",
  "frontend/src/components/LiveStreamCard.tsx": "A card component that displays a live stream's thumbnail, LIVE badge, random viewer count, title, and author info, triggering an onClick callback when clicked.",
  "frontend/src/components/LiveStreamDialog.tsx": "A dialog that allows the user to configure and start a live stream by selecting an author and entering a title, then notifying the parent via onStreamStart.",
  "frontend/src/components/LiveStreamViewer.tsx": "A dialog component that displays a simulated live stream view with the streamer's avatar, stream title, author info, and a random viewer count.",
  "frontend/src/components/MessageThread.tsx": "A full-height message thread component that displays a conversation's messages, supports sending new messages with Enter key, and shows loading/error states with skeletons.",
  "frontend/src/components/PostCard.tsx": "A card component that renders a social media post with author info, content, optional image, like button, and a toggleable comments panel.",
  "frontend/src/components/PostComposer.tsx": "A form component for creating new posts, allowing the user to select an author (self or character), write text content, and optionally attach an image up to 5MB.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A modal dialog shown on first use that prompts the user to enter their name and saves their profile to initialize their ToonSpace account.",
  "frontend/src/components/ScrollableSelectContent.tsx": "A wrapper around Radix UI's SelectContent that adds dynamic scroll-up and scroll-down indicator buttons based on the viewport's scroll position.",
  "frontend/src/components/StoriesRow.tsx": "A horizontally scrollable row of story avatars with a create button, opening either a story creation dialog or a story viewer dialog on interaction.",
  "frontend/src/components/StoryViewerDialog.tsx": "A modal dialog component that displays a single story with author info, timestamp, image, and caption overlaid with gradient headers/footers.",
  "frontend/src/components/VideoCard.tsx": "A card component that renders a video post with author avatar, name, timestamp, optional caption, and an HTML5 video player.",
  "frontend/src/components/VideoComposer.tsx": "A form component for creating and uploading video posts, supporting author selection, caption input, video file validation, and upload progress tracking.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including user profiles, characters, posts, comments, stories, videos, and conversations.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base styles, OKLCH-based CSS custom properties for light/dark themes, custom scrollbar styles, and scrollable select dropdown behavior.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Characters.tsx": "Displays a grid of user-created character profiles with options to add, edit, or delete characters via a form dialog and delete confirmation.",
  "frontend/src/pages/HomeFeed.tsx": "Renders the main social feed with a stories row, live stream section, post composer, and a sorted list of post cards with loading skeletons.",
  "frontend/src/pages/Messages.tsx": "Shows a list of conversations with character participants and previews the last message; selecting a conversation opens a full message thread view.",
  "frontend/src/pages/Profile.tsx": "Provides a form for the authenticated user to view and update their name, bio, and avatar, uploading changes via a save profile mutation.",
  "frontend/src/pages/SignIn.tsx": "Renders the ToonSpace sign-in landing page with an Internet Identity login button and app description.",
  "frontend/src/pages/Videos.tsx": "Displays a video feed with a composer for uploading new videos, live stream controls, and a sorted list of video cards with loading skeletons.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended border radii, box shadows, font family, and accordion keyframe animations, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking a bug-fix effort for a mobile app where the Messages screen shows 'No conversations yet' and navigating to a chat results in a blank screen due to the messaging system not being connected to the characters/friends system."
}