{
  "backend/main.mo": "Motoko canister defining user profiles, characters, posts, comments, stories, messages, and conversations with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs for scrollable dropdown improvements.",
  "frontend-file-summaries.txt": "Text file containing prewritten 1–2 sentence summaries of many frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables, dark theme overrides, and base element styling.",
  "frontend/index.html": "Root HTML document mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Top-level React component handling authentication flow, profile fetching, loading states, and conditional rendering of SignIn, ProfileSetupDialog, and AppShell.",
  "frontend/src/components/AppShell.tsx": "Authenticated app layout providing header, navigation, and page switching for Home, Messages, Characters, and Profile.",
  "frontend/src/components/AvatarImage.tsx": "Reusable avatar component generating initials fallback and cache-busted image URLs with retry logic.",
  "frontend/src/components/CharacterFormDialog.tsx": "Dialog for creating or editing a character, including name, bio, and optional avatar upload with progress tracking.",
  "frontend/src/components/CommentsPanel.tsx": "Displays and sorts post comments and provides a form to add new comments using user or character profiles.",
  "frontend/src/components/CreateConversationDialog.tsx": "Dialog to start a conversation by selecting characters and submitting to create a new conversation thread.",
  "frontend/src/components/CreateStoryDialog.tsx": "Dialog for creating a story post with an author selection, caption, and image upload with preview.",
  "frontend/src/components/MessageThread.tsx": "Renders a conversation thread with messages, auto-scrolling, sender selection, and the ability to send new messages.",
  "frontend/src/components/PostCard.tsx": "Displays a post with author info, content, image, like button, and optional comments panel.",
  "frontend/src/components/PostComposer.tsx": "Component for creating posts with text, selectable author, optional image upload, preview, and submission via createPost mutation.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users to enter a name and save their profile using saveProfile mutation.",
  "frontend/src/components/ScrollableSelectContent.tsx": "Custom SelectContent wrapper adding scroll indicators and auto‑detecting scrollability using viewport refs and ResizeObserver.",
  "frontend/src/components/StoriesRow.tsx": "Displays a horizontally scrollable row of stories, including a create button and story thumbnails that open dialogs.",
  "frontend/src/components/StoryViewerDialog.tsx": "Dialog that shows a full-screen view of a story with author info, timestamp, image, and caption.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, characters, posts, and conversations through the backend actor API.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables for light/dark modes, and custom scrollbar and dropdown behavior.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Characters.tsx": "Displays the user's characters with options to create, edit, and delete them using dialogs and avatar previews.",
  "frontend/src/pages/HomeFeed.tsx": "Shows the main feed including stories, a post composer, and a sorted list of posts with loading skeletons.",
  "frontend/src/pages/Messages.tsx": "Lists conversations, allows starting new chats, and displays message threads when a conversation is selected.",
  "frontend/src/pages/Profile.tsx": "Renders a user profile editor with fields for name, bio, and avatar upload, saving changes via React Query.",
  "frontend/src/pages/SignIn.tsx": "React sign‑in page using Internet Identity with a styled login button, logo, and themed background.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, radii, shadows, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project state file describing a mobile dropdown scrolling issue and related feature requests for the ToonSpace app."
}