{
  "backend/main.mo": "Defines the backend actor with access control, blob storage mixins, and all social data types and maps for profiles, posts, comments, stories, messages, and conversations.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to frontend files, components, and test IDs for scrollable select dropdown enhancements.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries for numerous frontend files describing their roles in the app’s UI, logic, and data flows.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light/dark modes and applying global background and border styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/ops/production-deployment-retry-runbook.md": "Runbook describing steps to retry production deployment of Draft Version 4 without code changes.",
  "frontend/src/App.tsx": "Root component handling authentication state, loading behavior, and showing either SignIn, profile setup, or the main AppShell.",
  "frontend/src/components/AppShell.tsx": "Main application shell with header, page routing via internal state, bottom navigation, and logout handling.",
  "frontend/src/components/AvatarImage.tsx": "Avatar component that renders user/character avatars with cache-busted URLs, retry logic, and fallback initials.",
  "frontend/src/components/CharacterFormDialog.tsx": "Dialog component for creating or editing a character, including name, bio, and avatar upload with progress tracking. Handles form submission, validation, and avatar preview.",
  "frontend/src/components/CommentsPanel.tsx": "Displays and sorts comments for a post and provides a form to submit new comments as the user or a character. Fetches profiles and handles comment creation.",
  "frontend/src/components/CreateConversationDialog.tsx": "Dialog for creating a new conversation by selecting characters to chat with. Manages character selection and submits the new conversation.",
  "frontend/src/components/CreateStoryDialog.tsx": "Dialog for creating a story post with an image, caption, and author selection. Handles image upload, preview, and story submission.",
  "frontend/src/components/MessageThread.tsx": "Displays messages in a conversation with auto‑scrolling and sender selection for new messages. Supports sending messages and viewing updated conversation data.",
  "frontend/src/components/PostCard.tsx": "Renders a social post with author info, text, image, like button, and expandable comments section. Handles like actions and fetches author profiles.",
  "frontend/src/components/PostComposer.tsx": "UI component for creating posts with text, optional image upload, author selection, and submission handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for initial user profile setup allowing name entry and saving via mutation.",
  "frontend/src/components/ScrollableSelectContent.tsx": "Custom scrollable select wrapper that shows scroll buttons based on viewport scroll position.",
  "frontend/src/components/StoriesRow.tsx": "Displays a horizontally scrollable row of stories with a create button and opens dialogs for creating or viewing stories.",
  "frontend/src/components/StoryViewerDialog.tsx": "Dialog that shows a full-screen story with author info, timestamp, image, and caption.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance, updating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication context providing login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, characters, posts, conversations, and related mutations using an actor backend.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes, scrollbars, and scrollable select components.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Characters.tsx": "Displays a list of characters with creation, editing, and deletion features using character-related queries.",
  "frontend/src/pages/HomeFeed.tsx": "Shows the post feed with stories, composer, loading skeletons, and sorted posts.",
  "frontend/src/pages/Messages.tsx": "Lists conversations, supports creating chats, and opens message threads for selected conversations.",
  "frontend/src/pages/Profile.tsx": "Renders user profile settings, including updating name, bio, and avatar with form handling and mutations.",
  "frontend/src/pages/SignIn.tsx": "React sign‑in page using Internet Identity with a styled login button and branding elements.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, typography, animations, and layout utilities with plugins.",
  "project_state.json": "JSON state describing project version, issues, and feature requests related to improving long-list scrolling in selection components."
}