{
  "backend/main.mo": "Motoko canister defining user profiles, character profiles, posts, comments, stories, messages, conversations, and access-controlled CRUD operations using blob storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, components, hooks, styles, and config.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode overrides, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component controlling authentication flow, loading states, and profile setup before rendering the app shell.",
  "frontend/src/components/AppShell.tsx": "Main authenticated layout with header, bottom navigation, logout handling, and page routing for home, messages, characters, and profile.",
  "frontend/src/components/AvatarImage.tsx": "Reusable avatar component displaying a blob image or generated initials with size variants and custom styling.",
  "frontend/src/components/CharacterFormDialog.tsx": "Modal form for creating or editing a character, handling name, bio, and avatar upload with previews.",
  "frontend/src/components/CommentsPanel.tsx": "Displays and sorts comments for a post and provides a form to add new comments as the user or a character.",
  "frontend/src/components/CreateConversationDialog.tsx": "Dialog to start a new conversation by selecting characters and submitting to create a conversation.",
  "frontend/src/components/CreateStoryDialog.tsx": "Form dialog for creating a story with an image, caption, and selectable author (user or character).",
  "frontend/src/components/MessageThread.tsx": "Renders a conversation thread with messages, auto‑scrolling, author resolution, and a form to send new messages.",
  "frontend/src/components/PostCard.tsx": "Displays a post with author info, content, image, like button, and an expandable comments section.",
  "frontend/src/components/PostComposer.tsx": "UI component for creating posts with text, optional image upload, and selectable author, sending data via createPost.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting the user to enter and save their profile name using saveProfile.",
  "frontend/src/components/StoriesRow.tsx": "Scrollable row showing stories, allowing creation of new stories and opening story viewer dialogs.",
  "frontend/src/components/StoryViewerDialog.tsx": "Dialog that displays a story image, caption, author info, and timestamp.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity lifecycle handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, characters, posts, stories, and related mutations.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive color variables for light and dark themes plus custom scrollbar styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Characters.tsx": "Displays, creates, edits, and deletes character profiles with UI cards and a character form dialog.",
  "frontend/src/pages/HomeFeed.tsx": "Shows a stories row, post composer, and a sorted feed of posts with loading skeletons.",
  "frontend/src/pages/Messages.tsx": "Lists conversations, opens message threads, and provides a dialog to start new chats.",
  "frontend/src/pages/Profile.tsx": "Renders user profile settings with avatar upload, name/bio editing, and save handling.",
  "frontend/src/pages/SignIn.tsx": "Displays a styled sign‑in screen using Internet Identity with branding and login button states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, including features, requirements, image needs, and architectural notes for a retro-themed private social app."
}