{
  "kind": "build_request",
  "title": "Fix mobile author/name picker scrolling and add visible scroll arrows",
  "projectName": "ToonSpace",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the author/name selection dropdowns reliably scrollable on mobile (vertical up/down) so the list does not overflow the viewport and finger scrolling works to reach all names.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "when the names come up, they all show, but the list doesn't show them completely in front of me and when I move my finger to try to scroll the list up and down, it won't move the names up and down.",
          "Like give them the ability to scroll through them names up and down."
        ]
      },
      "acceptanceCriteria": [
        "In PostComposer, CommentsPanel, CreateStoryDialog, and MessageThread, opening the author/sender Select on a mobile/touch device constrains the options list to a fixed max height (relative to viewport) and enables vertical scrolling within the list.",
        "On mobile, a finger swipe/drag inside the open dropdown scrolls the list up/down and does not scroll the page behind it.",
        "The last items in the list can be reached and selected on small screens without the dropdown extending off-screen.",
        "The scroll behavior is consistent across the post composer, comment composer, story composer, and message sender selector."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a clear scroll affordance to the open name dropdown list by showing a side scroll indicator/arrow controls when the list is scrollable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Like give them a side scrolling arrow too."
        ]
      },
      "acceptanceCriteria": [
        "When the Select dropdown list has overflow (more items than the visible area), the UI displays a clear visual indicator on the side that the list can be scrolled (e.g., up/down chevrons on the right edge and/or a visible scrollbar track/thumb).",
        "The indicator does not block tapping list items and does not prevent touch scrolling.",
        "If the list does not overflow, the scroll indicator/arrow controls are hidden or visually disabled."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the mobile scrolling fix applies to all existing user/character author selection Select components used when creating content (post/comment/story/message) so no screen still uses a non-scrollable dropdown variant.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "the list doesn't show them completely in front of me",
          "give them the ability to scroll through them names up and down"
        ]
      },
      "acceptanceCriteria": [
        "A code review confirms the author/sender SelectContent in: frontend/src/components/PostComposer.tsx, frontend/src/components/CommentsPanel.tsx, frontend/src/components/CreateStoryDialog.tsx, and frontend/src/components/MessageThread.tsx all include the same scrollable dropdown treatment (max height + overflow + touch-friendly scrolling + indicator behavior).",
        "No regression: selecting an author/sender still works and the selected value renders correctly in the SelectTrigger in all affected components."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI components must be composed, not edited).",
    "Keep the Internet Identity/auth hooks unchanged (frontend/src/hooks/useInternetIdentity.ts / useActor.ts are immutable).",
    "Do not introduce new backend canisters or external services; this change must be frontend-only."
  ],
  "nonGoals": [
    "Do not implement a full-screen picker modal unless explicitly requested later.",
    "Do not change backend data models for users/characters/posts/comments/messages.",
    "Do not add real-time syncing or WebSocket-based updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}