{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile-friendly scrollable author Select dropdowns with visible scroll arrows",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure author/sender Select option lists are viewport-constrained and reliably finger-scrollable on mobile without scrolling the page behind.",
      "acceptanceCriteria": [
        "In PostComposer, CommentsPanel, CreateStoryDialog, and MessageThread, opening the author/sender Select on a mobile/touch device constrains the options list to a fixed max height (relative to viewport) and enables vertical scrolling within the list.",
        "On mobile, a finger swipe/drag inside the open dropdown scrolls the list up/down and does not scroll the page behind it.",
        "The last items in the list can be reached and selected on small screens without the dropdown extending off-screen.",
        "The scroll behavior is consistent across the post composer, comment composer, story composer, and message sender selector."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ScrollableSelectContent.tsx",
          "operation": "create",
          "description": "Create a reusable wrapper that composes the existing shadcn SelectContent (do not edit ui components) to: constrain option list height relative to viewport, enable touch momentum scrolling, contain overscroll to prevent background/page scroll, and expose hooks needed for scroll-state detection. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS utility classes (used by ScrollableSelectContent) to improve mobile/touch scrolling reliability (e.g., overscroll containment, touch-action pan-y, and -webkit-overflow-scrolling) without modifying any files under frontend/src/components/ui."
        },
        {
          "path": "frontend/src/components/PostComposer.tsx",
          "operation": "modify",
          "description": "Replace the inline SelectContent max-height/overflow styling with the new ScrollableSelectContent wrapper so the author dropdown is viewport-constrained and reliably scrollable on mobile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CommentsPanel.tsx",
          "operation": "modify",
          "description": "Update the author Select dropdown to use ScrollableSelectContent to ensure touch scrolling works and the list does not overflow the viewport on mobile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CreateStoryDialog.tsx",
          "operation": "modify",
          "description": "Update the author Select dropdown to use ScrollableSelectContent to ensure touch scrolling works and the list does not overflow the viewport on mobile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MessageThread.tsx",
          "operation": "modify",
          "description": "Update the sender Select dropdown to use ScrollableSelectContent to ensure touch scrolling works and the list does not overflow the viewport on mobile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a visible scroll affordance (side indicator and up/down arrow controls) to name dropdowns only when the option list overflows.",
      "acceptanceCriteria": [
        "When the Select dropdown list has overflow (more items than the visible area), the UI displays a clear visual indicator on the side that the list can be scrolled (e.g., up/down chevrons on the right edge and/or a visible scrollbar track/thumb).",
        "The indicator does not block tapping list items and does not prevent touch scrolling.",
        "If the list does not overflow, the scroll indicator/arrow controls are hidden or visually disabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ScrollableSelectContent.tsx",
          "operation": "modify",
          "description": "Enhance ScrollableSelectContent to detect overflow and current scroll position and render right-edge up/down chevrons as a scroll affordance; ensure indicators/controls do not block option taps and do not interfere with touch scrolling; hide/disable indicators when there is no overflow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal styling support for the dropdown scroll affordance (e.g., positioning, gradients, and pointer-events behavior) used by ScrollableSelectContent so the arrows are clearly visible without blocking interactions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply the same scrollable dropdown + indicator treatment to all existing author/sender Select usages in post/comment/story/message creation UIs.",
      "acceptanceCriteria": [
        "A code review confirms the author/sender SelectContent in: frontend/src/components/PostComposer.tsx, frontend/src/components/CommentsPanel.tsx, frontend/src/components/CreateStoryDialog.tsx, and frontend/src/components/MessageThread.tsx all include the same scrollable dropdown treatment (max height + overflow + touch-friendly scrolling + indicator behavior).",
        "No regression: selecting an author/sender still works and the selected value renders correctly in the SelectTrigger in all affected components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PostComposer.tsx",
          "operation": "modify",
          "description": "Standardize the author dropdown to use ScrollableSelectContent (and remove any divergent inline SelectContent scroll styling) so behavior matches the other author/sender pickers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CommentsPanel.tsx",
          "operation": "modify",
          "description": "Standardize the comment author dropdown to use ScrollableSelectContent (and remove any divergent inline SelectContent scroll styling) so behavior matches the other author/sender pickers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CreateStoryDialog.tsx",
          "operation": "modify",
          "description": "Standardize the story author dropdown to use ScrollableSelectContent (and remove any divergent inline SelectContent scroll styling) so behavior matches the other author/sender pickers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MessageThread.tsx",
          "operation": "modify",
          "description": "Standardize the message sender dropdown to use ScrollableSelectContent (and remove any divergent inline SelectContent scroll styling) so behavior matches the other author/sender pickers. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}