{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Scrollable long-name Select dropdowns with Radix up/down controls",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make long-name Select dropdowns reliably vertically scrollable (wheel/trackpad/touch) and add explicit Up/Down controls without blocking item interaction.",
      "acceptanceCriteria": [
        "When a Select dropdown contains more items than can fit on screen, the dropdown viewport scrolls vertically via mouse wheel/trackpad on desktop.",
        "On touch devices, the dropdown viewport scrolls vertically via touch drag inside the list.",
        "Visible Up and Down controls are present for overflowing lists and pressing them scrolls the list up/down.",
        "Users can scroll to and select names at both the top and bottom of long lists without the list getting stuck.",
        "No UI element (e.g., scroll indicators) blocks taps/clicks on list items."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ScrollableSelectContent.tsx",
          "operation": "modify",
          "description": "Replace the current non-interactive top/bottom scroll indicators with an implementation that preserves vertical scrolling and supports touch dragging inside the viewport; ensure the Select viewport element remains the scroll container and that added UI does not intercept list item clicks."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust the .scrollable-select-content styles so the Radix Select viewport consistently supports overflow scrolling (desktop wheel/trackpad + mobile touch drag) and ensure any scroll affordances/buttons do not overlay and block selecting items."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement functional in-dropdown up/down scroll buttons using the already-imported Radix SelectScrollUpButton/SelectScrollDownButton and show them only when scrolling is possible.",
      "acceptanceCriteria": [
        "ScrollableSelectContent renders functional Up/Down scroll buttons (not just visual indicators) when the list can scroll.",
        "Up button is hidden/disabled at the top of the list; Down button is hidden/disabled at the bottom of the list.",
        "Holding or repeatedly pressing the buttons scrolls through the list predictably."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ScrollableSelectContent.tsx",
          "operation": "modify",
          "description": "Use Radix SelectScrollUpButton and SelectScrollDownButton (already imported) inside ScrollableSelectContent; wire them to appear only when the viewport can scroll up/down based on current scroll position and content height, and ensure press-and-hold/repeat behavior works predictably."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust styling hooks for the Radix scroll buttons rendered by ScrollableSelectContent (e.g., sizing, alignment, background) so they are visible, tappable, and do not obstruct the viewport's selectable items."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure all name/friend/character Select dropdowns use the shared ScrollableSelectContent so the long-list scrolling fix applies everywhere.",
      "acceptanceCriteria": [
        "All existing Select-based name pickers across the app use the scroll-enabled dropdown content component.",
        "At least the selectors in PostComposer and CommentsPanel continue to work and allow reaching any name with many entries.",
        "No regressions: selecting an item still closes the dropdown and sets the selected value correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PostComposer.tsx",
          "operation": "modify",
          "description": "Audit the author selector Select usage to confirm it uses ScrollableSelectContent (not plain SelectContent) and update any props/structure needed to remain compatible with the improved scroll buttons and scrolling behavior."
        },
        {
          "path": "frontend/src/components/CommentsPanel.tsx",
          "operation": "modify",
          "description": "Audit the comment author selector Select usage to ensure it uses ScrollableSelectContent everywhere and adjust wiring if needed so selecting an item still closes the dropdown and updates the selected value correctly."
        },
        {
          "path": "frontend/src/components/CreateStoryDialog.tsx",
          "operation": "modify",
          "description": "Audit the story author selector Select usage to ensure it uses ScrollableSelectContent and remains compatible with the improved scrollable dropdown behavior for long character lists."
        },
        {
          "path": "frontend/src/components/MessageThread.tsx",
          "operation": "modify",
          "description": "Audit the message sender selector Select usage to ensure it uses ScrollableSelectContent and validate that long sender lists can be fully reached and selected without the dropdown getting stuck."
        }
      ]
    }
  ]
}